Catalogs/ПользователиИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ПользователиИнформационнойБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПользователиИнформационнойБазы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();	
	КонецЕсли;
	
	Пользователь.АдресЭлектроннойПочты = Объект.ФизическоеЛицо.Email;
	Пользователь.Имя = Объект.Наименование;
	Пользователь.ПолноеИмя = Объект.ФизическоеЛицо.Наименование;
	Пользователь.Пароль = Объект.Пароль;
	Пользователь.ПоказыватьВСпискеВыбора = Объект.ПоказыватьВСпискеВыбора;
	Пользователь.Роли.Очистить();
	
	Для Каждого Роль Из Роли Цикл
		Если Роль.Доступ Тогда
			Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.НаименованиеРоли));	
		КонецЕсли;	
	КонецЦикла;
	
	Пользователь.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Роль из Метаданные.Роли Цикл
		Если СтрНачинаетсяС(Роль.Представление(), "___") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = Роли.Добавить();
		
		Если ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование).Роли.Содержит(Роль) Тогда
			СтрокаТЧ.Доступ = Истина;	
		КонецЕсли;
		СтрокаТЧ.НаименованиеРоли = Роль.Представление();
	КонецЦикла;
КонецПроцедуры
